---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartLengthOption
source: html/9b3a7210-df80-81c9-46ff-243289df19f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartLengthOption Property

"Length Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartLengthOption { get; }
```